load-testing/search.yml
config:
  target: 'http://localhost:8080'
  phases:
    - duration: 60
      arrivalRate: 100
      # rampTo: 100
      name: "Warm up"
    # - duration: 15
    #   arrivalRate: 100
    #   name: 'Sustained light load'
    # - duration: 15
    #   arrivalRate: 100
    #   rampTo: 300
    #   name: 'Going to max'    
    # - duration: 60
    #   arrivalRate: 300
    #   name: 'Sustained max'  
  processor: "./generateSearchQueries.js"
      
scenarios:
  - name: "Search for listings"
    flow:
    - function: "generateSemiSearch"
    - get:
        url: "/listings/search?q={{ name }}"
    # - log: "Sent a search {{ name }}"