load-testing/search.yml
config:
  target: 'http://localhost:8080'
  phases:
    - duration: 30
      arrivalRate: 1
      rampTo: 100
      name: "Warm up"
    - duration: 30
      arrivalRate: 100
      name: 'Sustained light load'
    - duration: 30
      arrivalRate: 100
      rampTo: 500
      name: 'Going to max'    
    - duration: 30
      arrivalRate: 500
      name: 'Sustained max'  
  processor: "./generateSearchQueries.js"
      
scenarios:
  - name: "Search for listings"
    flow:
    - function: "generateSemiSearch"
    - get:
        url: "/listings/search?q={{ name }}"
    # - log: "Sent a search {{ name }}"